---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSegment.ScheduleTypeId
source: html/c0475662-4896-fbd8-5431-c61952f62960.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSegment.ScheduleTypeId Property

The ElementId of the PipeScheduleType.

## Syntax (C#)
```csharp
public ElementId ScheduleTypeId { get; }
```